/***************************************************************************
========================================================================
Company	:	HBG      Copyright (c) 2010   
Author		:	Kalvin				
版权信息	:	Copyright (c) 2010 HBG Hi Tech	
File		: 	ARC_DATA.C	
VER		:	1.0.0		
Development	: 	VC++ 6.0	
Data		:	2010-08-11		
Customer	:	浩博高			
-------------------------History list-----------------------------------	
*****************************************************************************/
#include "remote.h"
/*******************const define**********************************************/
const u8  BIT_ADR_MASK_TAB[]={0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80};
const u8  ADR_VAR_VAL_MAX[]={4,16,3,9,9,9,24,24,24,16,255,6,3,59,144,144,24,60,24,60};	//控制变量取值表


//=========================================================================
// 将码组号转成相应的控制符表序号
//=========================================================================
/********************码组控制符转换表************************************/
const u8  GROUP_CHANG_Array[]={ 
15,  //000  格力2           格力    	
157,  //001  格力1           格力
4,  //002  格力14          格力
3,  //003  格力10          格力
38,  //004  格力12          格力
2,  //005  格力13          格力
8,  //006  志高15          格力
31,  //007  格力6           格力
157,  //008  格力1           格力
38,  //009  格力12          格力
103,  //010  格力11          格力
3,  //011  格力10          格力
133,  //012  三菱19          格力
105,  //013  三菱12          格力
8,  //014  志高15          格力
157,  //015  格力1           格力
4,  //016  格力14          格力
3,  //017  格力10          格力
38,  //018  格力12          格力
2,  //019  格力13          格力
15,  //020  格力2           格力
31,  //021  格力6           格力
169,         // 022	格力YAD0F 	       		BY RICHARD
38,  //023  格力12          格力
103,  //024  格力11          格力
168,    // 025	美的-东芝：R09B/BGCE	 			BY RICHARD                      
14,  //026  美的(东芝)3     美的/东芝                    
133,  //027  三菱19          美的/东芝                    
10,  //028  美的(东芝)11    美的/东芝                    
82,  //029  美的(东芝)9     美的/东芝                    
105,  //030  三菱12          美的/东芝                    
82,  //031  美的(东芝)9     美的/东芝                    
105,  //032  三菱12          美的/东芝                    
14,  //033  美的(东芝)3     美的/东芝                    
133,  //034  三菱19          美的/东芝                    
10,  //035  美的(东芝)11    美的/东芝                    
82,  //036  美的(东芝)9     美的/东芝                    
105,  //037  三菱12          美的/东芝                    
82,  //038  美的(东芝)9     美的/东芝                    
105,  //039  三菱12          美的/东芝                    
14,  //040  美的(东芝)3     美的/东芝                    
133,  //041  三菱19          美的/东芝                    
10,  //042  美的(东芝)11    美的/东芝                    
82,  //043  美的(东芝)9     美的/东芝                    
105,  //044  三菱12          美的/东芝                    
1,  //045  长虹5           长虹
13,  //046  长虹16          长虹
37,  //047  长虹4           长虹
33,  //048  长虹3           长虹
32,  //049  长虹2           长虹
14,  //050  美的(东芝)3     长虹
26,  //051  奥克斯4         长虹
33,  //052  长虹3           长虹
35,  //053  长虹9           长虹
26,  //054  奥克斯4         长虹
36,  //055  长虹12          长虹
37,  //056  长虹4           长虹
35,  //057  长虹9           长虹
46,  //058  长虹10          长虹
117,  //059  伊莱克斯1       长虹
1,  //060  长虹5           长虹
13,  //061  长虹16          长虹
37,  //062  长虹4           长虹
33,  //063  长虹3           长虹
32,  //064  长虹2           长虹
14,  //065  美的(东芝)3     长虹
26,  //066  奥克斯4         长虹
33,  //067  长虹3           长虹
35,  //068  长虹9           长虹
26,  //069  奥克斯4         长虹
36,  //070  长虹12          长虹
37,  //071  长虹4           长虹
35,  //072  长虹9           长虹
46,  //073  长虹10          长虹
117,  //074  伊莱克斯1       长虹
5,  //075  志高10          志高
8,  //076  志高15          志高
110,  //077  志高7           志高
9,  //078  志高2           志高
60,  //079  三菱1           志高
66,  //080  格兰仕6         志高
110,  //081  志高7           志高
62,  //082  志高3           志高
8,  //083  志高15          志高
68,  //084  TCL5            志高
133,  //085  三菱19          志高
64,  //086  志高12          志高
63,  //087  三菱9           志高
65,  //088  格兰仕3         志高
74,  //089  志高6           志高
67,  //090  华凌5           志高
72,  //091  志高13          志高
74,  //092  志高6           志高
69,  //093  志高14          志高
105,  //094  三菱12          志高
9,  //095  志高2           志高
5,  //096  志高10          志高
8,  //097  志高15          志高
110,  //098  志高7           志高
9,  //099  志高2           志高
60,  //100  三菱1           志高
66,  //101  格兰仕6         志高
110,  //102  志高7           志高
62,  //103  志高3           志高
8,  //104  志高15          志高
68,  //105  TCL5            志高
133,  //106  三菱19          志高
64,  //107  志高12          志高
63,  //108  三菱9           志高
65,  //109  格兰仕3         志高
86,  //110  松下(乐声)6     松下/乐声                    
92,  //111  松下(乐声)2     松下/乐声                    
85,  //112  松下(乐声)19    松下/乐声                    
90,  //113  松下(乐声)18    松下/乐声                    
87,  //114  松下(乐声)7     松下/乐声                    
106,  //115  松下(乐声)9     松下/乐声                    
90,  //116  松下(乐声)18    松下/乐声                    
91,  //117  松下(乐声)13    松下/乐声                    
30,  //118  LG10            松下/乐声                    
88,  //119  松下(乐声)3     松下/乐声                    
92,  //120  松下(乐声)2     松下/乐声                    
93,  //121  松下(乐声)17    松下/乐声                    
94,  //122  松下(乐声)21    松下/乐声                    
95,  //123  松下(乐声)16    松下/乐声                    
89,  //124  松下(乐声)8     松下/乐声                    
95,  //125  松下(乐声)16    松下/乐声                    
87,  //126  松下(乐声)7     松下/乐声                    
86,  //127  松下(乐声)6     松下/乐声                    
92,  //128  松下(乐声)2     松下/乐声                    
85,  //129  松下(乐声)19    松下/乐声                    
90,  //130  松下(乐声)18    松下/乐声                    
87,  //131  松下(乐声)7     松下/乐声                    
106,  //132  松下(乐声)9     松下/乐声                    
90,  //133  松下(乐声)18    松下/乐声                    
91,  //134  松下(乐声)13    松下/乐声                    
30,  //135  LG10            松下/乐声                    
88,  //136  松下(乐声)3     松下/乐声                    
92,  //137  松下(乐声)2     松下/乐声                    
93,  //138  松下(乐声)17    松下/乐声                    
94,  //139  松下(乐声)21    松下/乐声                    
39,  //140  海尔18          海尔
44,  //141  海尔12          海尔
6,  //142  海尔19          海尔
39,  //143  海尔18          海尔
41,  //144  海尔15          海尔
8,  //145  志高15          海尔
11,  //146  海尔1           海尔
12,  //147  夏普18          海尔
40,  //148  海尔3           海尔
44,  //149  海尔12          海尔
42,  //150  海尔9           海尔
43,  //151  海尔13          海尔
8,  //152  志高15          海尔
39,  //153  海尔18          海尔
44,  //154  海尔12          海尔
6,  //155  海尔19          海尔
39,  //156  海尔18          海尔
41,  //157  海尔15          海尔
8,  //158  志高15          海尔
11,  //159  海尔1           海尔
12,  //160  夏普18          海尔
40,  //161  海尔3           海尔
44,  //162  海尔12          海尔
42,  //163  海尔9           海尔
43,  //164  海尔13          海尔
62,  //165  志高3           三菱 
5,  //166  志高10          三菱 
8,  //167  志高15          三菱 
133,  //168  三菱19          三菱 
60,  //169  三菱1           三菱 
65,  //170  格兰仕3         三菱 
63,  //171  三菱9           三菱 
158,  //172  三凌KP2ES       三菱 
130,  //173  三菱7           三菱 
67,  //174  华凌5           三菱 
128,  //175  三菱14          三菱 
69,  //176  志高14          三菱 
105,  //177  三菱12          三菱 
127,  //178  三菱13          三菱 
99,  //179  春兰2           三菱 
129,  //180  三菱4           三菱 
126,  //181  三菱10          三菱 
132,  //182  三菱17          三菱 
68,  //183  TCL5            三菱 
9,  //184  志高2           三菱 
131,  //185  三菱8           三菱 
128,  //186  三菱14          三菱 
66,  //187  格兰仕6         三菱 
62,  //188  志高3           三菱 
5,  //189  志高10          三菱 
8,  //190  志高15          三菱 
133,  //191  三菱19          三菱 
60,  //192  三菱1           三菱 
65,  //193  格兰仕3         三菱 
63,  //194  三菱9           三菱 
158,  //195  三凌KP2ES       三菱 
130,  //196  三菱7           三菱 
67,  //197  华凌5           三菱 
128,  //198  三菱14          三菱 
69,  //199  志高14          三菱 
105,  //200  三菱12          三菱 
127,  //201  三菱13          三菱 
99,  //202  春兰2           三菱 
129,  //203  三菱4           三菱 
126,  //204  三菱10          三菱 
65,  //205  格兰仕3         格兰仕                       
8,  //206  志高15          格兰仕                       
66,  //207  格兰仕6         格兰仕                       
70,  //208  格兰仕1         格兰仕                       
69,  //209  志高14          格兰仕                       
70,  //210  格兰仕1         格兰仕                       
60,  //211  三菱1           格兰仕                       
5,  //212  志高10          格兰仕                       
99,  //213  春兰2           格兰仕                       
161,  //214  志高15          格兰仕  8       2011-12-17 14:50              
162,  //215  格兰仕3         格兰仕  65               2011-12-17 14:50       
8,  //216  志高15          格兰仕                       
66,  //217  格兰仕6         格兰仕                       
70,  //218  格兰仕1         格兰仕                       
69,  //219  志高14          格兰仕                       
70,  //220  格兰仕1         格兰仕                       
60,  //221  三菱1           格兰仕                       
5,  //222  志高10          格兰仕                       
99,  //223  春兰2           格兰仕                       
8,  //224  志高15          格兰仕                       
7,  //225  科龙(华宝)1     科龙/华宝                    
77,  //226  科龙(华宝)10    科龙/华宝                    
78,  //227  科龙(华宝)11    科龙/华宝                    
8,  //228  志高15          科龙/华宝                    
79,  //229  科龙(华宝)9     科龙/华宝                    
58,  //230  科龙(华宝)5     科龙/华宝                    
80,  //231  科龙(华宝)6     科龙/华宝                    
7,  //232  科龙(华宝)1     科龙/华宝                    
77,  //233  科龙(华宝)10    科龙/华宝                    
81,  //234  科龙(华宝)7     科龙/华宝                    
104,  //235  科龙(华宝)8     科龙/华宝                    
79,  //236  科龙(华宝)9     科龙/华宝                    
7,  //237  科龙(华宝)1     科龙/华宝                    
77,  //238  科龙(华宝)10    科龙/华宝                    
78,  //239  科龙(华宝)11    科龙/华宝                    
8,  //240  志高15          科龙/华宝                    
79,  //241  科龙(华宝)9     科龙/华宝                    
58,  //242  科龙(华宝)5     科龙/华宝                    
80,  //243  科龙(华宝)6     科龙/华宝                    
7,  //244  科龙(华宝)1     科龙/华宝                    
77,  //245  科龙(华宝)10    科龙/华宝                    
81,  //246  科龙(华宝)7     科龙/华宝                    
104,  //247  科龙(华宝)8     科龙/华宝                    
79,  //248  科龙(华宝)9     科龙/华宝                    
7,  //249  科龙(华宝)1     科龙/华宝                    
16,  //250  奥克斯1         奥克斯                       
22,  //251  奥克斯7         奥克斯                       
17,  //252  奥克斯3         奥克斯                       
0,  //253  奥克斯9         奥克斯                       
26,  //254  奥克斯4         奥克斯                       
21,  //255  奥克斯14        奥克斯                       
18,  //256  奥克斯15        奥克斯                       
25,  //257  奥克斯2         奥克斯                       
23,  //258  奥克斯6         奥克斯                       
26,  //259  奥克斯4         奥克斯                       
19,  //260  奥克斯12        奥克斯                       
24,  //261  奥克斯11        奥克斯                       
160,  //262  奥克斯7         奥克斯              22 2011-12-17 14:50         
20,  //263  奥克斯13        奥克斯                       
21,  //264  奥克斯14        奥克斯                       
16,  //265  奥克斯1         奥克斯                       
22,  //266  奥克斯7         奥克斯                       
17,  //267  奥克斯3         奥克斯                       
0,  //268  奥克斯9         奥克斯                       
26,  //269  奥克斯4         奥克斯                       
21,  //270  奥克斯14        奥克斯                       
18,  //271  奥克斯15        奥克斯                       
25,  //272  奥克斯2         奥克斯                       
23,  //273  奥克斯6         奥克斯                       
26,  //274  奥克斯4         奥克斯                       
107,  //275  夏普1           夏普/声宝                    
96,  //276  夏普15          夏普/声宝                    
12,  //277  夏普18          夏普/声宝                    
107,  //278  夏普1           夏普/声宝                    
108,  //279  夏普16          夏普/声宝                    
97,  //280  夏普2           夏普/声宝                    
12,  //281  夏普18          夏普/声宝                    
107,  //282  夏普1           夏普/声宝                    
96,  //283  夏普15          夏普/声宝                    
12,  //284  夏普18          夏普/声宝                    
107,  //285  夏普1           夏普/声宝                    
108,  //286  夏普16          夏普/声宝                    
97,  //287  夏普2           夏普/声宝                    
12,  //288  夏普18          夏普/声宝                    
107,  //289  夏普1           夏普/声宝                    
96,  //290  夏普15          夏普/声宝                    
12,  //291  夏普18          夏普/声宝                    
107,  //292  夏普1           夏普/声宝                    
108,  //293  夏普16          夏普/声宝                    
97,  //294  夏普2           夏普/声宝                    
48,  //295  大金1           大金
49,  //296  大金10          大金
50,  //297  大金11          大金
57,  //298  大金9           大金
51,  //299  大金2           大金
52,  //300  大金3           大金
56,  //301  大金8           大金
167,   //302		大金-ARC433A49	     	BY RICHARD
53,  //303  大金4           大金
57,  //304  大金9           大金
55,  //305  大金7           大金
50,  //306  大金11          大金
84,  //307  华凌6           大金
54,  //308  大金6           大金
52,  //309  大金3           大金
48,  //310  大金1           大金
49,  //311  大金10          大金
50,  //312  大金11          大金
57,  //313  大金9           大金
51,  //314  大金2           大金
52,  //315  大金3           大金
56,  //316  大金8           大金
48,  //317  大金1           大金
53,  //318  大金4           大金
57,  //319  大金9           大金
8,  //320  志高15          海信
47,  //321  海信3           海信
46,  //322  长虹10          海信
170,           //323	海信DG11J1-01                	BY RICHARD
37,  //324  长虹4           海信
58,  //325  科龙(华宝)5     海信
59,  //326  海信11          海信
8,  //327  志高15          海信
61,  //328  海信5           海信
127,  //329  三菱13          海信
59,  //330  海信11          海信
8,  //331  志高15          海信
47,  //332  海信3           海信
46,  //333  长虹10          海信
61,  //334  海信5           海信
37,  //335  长虹4           海信
58,  //336  科龙(华宝)5     海信
59,  //337  海信11          海信
8,  //338  志高15          海信
61,  //339  海信5           海信
113,  //340  富士通3         富士通                       
111,  //341  富士通1         富士通                       
114,  //342  富士通5         富士通                       
159,  //343  富士通7         富士通            116  2011-12-17 14:53           
112,  //344  富士通2         富士通                       
111,  //345  富士通1         富士通                       
116,  //346  富士通7         富士通                       
115,  //347  富士通6         富士通                       
113,  //348  富士通3         富士通                       
115,  //349  富士通6         富士通                       
113,  //350  富士通3         富士通                       
111,  //351  富士通1         富士通                       
114,  //352  富士通5         富士通                       
116,  //353  富士通7         富士通                       
112,  //354  富士通2         富士通                       
111,  //355  富士通1         富士通                       
116,  //356  富士通7         富士通                       
115,  //357  富士通6         富士通                       
113,  //358  富士通3         富士通                       
115,  //359  富士通6         富士通                       
9,  //360  志高2           华凌
5,  //361  志高10          华凌
8,  //362  志高15          华凌
67,  //363  华凌5           华凌
5,  //364  志高10          华凌
62,  //365  志高3           华凌
65,  //366  格兰仕3         华凌
63,  //367  三菱9           华凌
66,  //368  格兰仕6         华凌
63,  //369  三菱9           华凌
75,  //370  华凌7           华凌
76,  //371  华凌3           华凌
69,  //372  志高14          华凌
84,  //373  华凌6           华凌
75,  //374  华凌7           华凌
156,  //375  加组三星1       华凌     
68,  //376  TCL5            华凌
9,  //377  志高2           华凌
5,  //378  志高10          华凌
8,  //379  志高15          华凌
67,  //380  华凌5           华凌
5,  //381  志高10          华凌
62,  //382  志高3           华凌
65,  //383  格兰仕3         华凌
63,  //384  三菱9           华凌
27,  //385  LG13            LG  
29,  //386  LG8             LG  
27,  //387  LG13            LG  
30,  //388  LG10            LG  
28,  //389  LG3             LG  
27,  //390  LG13            LG  
27,  //391  LG13            LG  
29,  //392  LG8             LG  
27,  //393  LG13            LG  
30,  //394  LG10            LG  
83,  //395  日立3           日立
134,  //396  日立5           日立
135,  //397  日立1           日立
165,			//398	日立 S-03     	BY RICHARD 
136,  //399  日立7           日立
155,  //400  日立(2002D)     日立
136,  //401  日立7           日立
135,  //402  日立1           日立
83,  //403  日立3           日立
134,  //404  日立5           日立
135,  //405  日立1           日立
135,  //406  日立1           日立
136,  //407  日立7           日立
155,  //408  日立(2002D)     日立
136,  //409  日立7           日立
67,  //410  华凌5           TCL 
5,  //411  志高10          TCL 
66,  //412  格兰仕6         TCL 
73,  //413  TCL3            TCL 
156,  //414  加组三星1       TCL      
68,  //415  TCL5            TCL 
65,  //416  格兰仕3         TCL 
174,          //417	3号机-RC-71-1   TCL			BY RICHARD 
69,  //418  志高14          TCL 
67,  //419  华凌5           TCL 
5,  //420  志高10          TCL 
166,	        //421	6号机-RC-4(HL)  TCL			BY RICHARD  
73,  //422  TCL3            TCL 
156,  //423  加组三星1       TCL      
68,  //424  TCL5            TCL 
37,  //425  长虹4           三洋
123,  //426  三洋1           三洋
163,  //427  长虹4           三洋      37     2011-12-17 14:50         
47,  //428  海信3           三洋
124,  //429  三洋2           三洋
125,  //430  三洋3           三洋
47,  //431  海信3           三洋
114,  //432  富士通5         三洋
32,  //433  长虹2           三洋
37,  //434  长虹4           三洋
37,  //435  长虹4           三洋
123,  //436  三洋1           三洋
37,  //437  长虹4           三洋
47,  //438  海信3           三洋
124,  //439  三洋2           三洋
58,  //440  科龙(华宝)5     惠而浦                       
137,  //441  惠而浦2         惠而浦                       
86,  //442  松下(乐声)6     惠而浦                       
58,  //443  科龙(华宝)5     惠而浦                       
137,  //444  惠而浦2         惠而浦                       
100,  //445  乐华2           乐华
101,  //446  乐华1           乐华
100,  //447  乐华2           乐华
100,  //448  乐华2           乐华
101,  //449  乐华1           乐华
14,  //450  美的(东芝)3     伊莱克斯                     
117,  //451  伊莱克斯1       伊莱克斯                     
118,  //452  伊莱克斯3       伊莱克斯                     
14,  //453  美的(东芝)3     伊莱克斯                     
117,  //454  伊莱克斯1       伊莱克斯                     
14,  //455  美的(东芝)3     伊莱克斯                     
117,  //456  伊莱克斯1       伊莱克斯                     
118,  //457  伊莱克斯3       伊莱克斯                     
14,  //458  美的(东芝)3     伊莱克斯                     
117,  //459  伊莱克斯1       伊莱克斯                     
14,  //460  美的(东芝)3     约克
65,  //461  格兰仕3         约克
119,  //462  约克1           约克
120,  //463  约克3           约克
121,  //464  约克6           约克
14,  //465  美的(东芝)3     约克
65,  //466  格兰仕3         约克
119,  //467  约克1           约克
120,  //468  约克3           约克
121,  //469  约克6           约克
34,  //470  澳克玛2         澳柯玛                       
65,  //471  格兰仕3         澳柯玛                       
71,  //472  澳克玛3         澳柯玛                       
34,  //473  澳克玛2         澳柯玛                       
65,  //474  格兰仕3         澳柯玛                       
99,  //475  春兰2           春兰
98,  //476  春兰1           春兰
102,  //477  春兰4           春兰
99,  //478  春兰2           春兰
98,  //479  春兰1           春兰
109,  //480  新科2           新科
122,  //481  新科3           新科
109,  //482  新科2           新科
122,  //483  新科3           新科
109,  //484  新科2           新科
45,  //485  小三星          三星
150,  //486  ;三星3          三星
156,  //487  加组三星1       三星     
45,  //488  小三星          三星
150,  //489  ;三星3          三星
143,  //490  ;开利1          开利
144,  //491  ;开利3          开利
151,  //492  开利2           开利
143,  //493  ;开利1          开利
171,    //494	开利RFL-0601EHL  				BY RICHRAD 
152,  //495  蓝波            蓝波
60,  //496  三菱1           蓝波
117,  //497  伊莱克斯1       蓝波
37,  //498  长虹4           蓝波
14,  //499  美的(东芝)3     蓝波
149,  //500  ;新飞           新飞
60,  //501  三菱1           新飞
117,  //502  伊莱克斯1       新飞
173,    //503	新飞YK-040L     新飞		by richard 
14,  //504  美的(东芝)3     新飞
153,  //505  麦克维尔        麦克维尔                     
121,  //506  约克6           麦克维尔                     
117,  //507  伊莱克斯1       麦克维尔                     
37,  //508  长虹4           麦克维尔                     
14,  //509  美的(东芝)3     麦克维尔                     
142,  //510  ;汇丰2          汇丰
105,  //511  三菱12          汇丰
172,   //512		FUNIKI--1   		RICHRAD   
146,  //513  南风            南风
146,  //514  南风            南风
140,  //515  ;大宇2          大宇
140,  //516  ;大宇2          大宇
148,  //517  ;先科           先科
148,  //518  ;先科           先科
154,  //519  胜风            胜风
154,  //520  胜风            胜风
65,  //521  格兰仕3         扬子
60,  //522  三菱1           扬子
117,  //523  伊莱克斯1       扬子
37,  //524  长虹4           扬子
14,  //525  美的(东芝)3     扬子
60,  //526  三菱1           万宝
65,  //527  格兰仕3         万宝
117,  //528  伊莱克斯1       万宝
37,  //529  长虹4           万宝
14,  //530  美的(东芝)3     万宝
60,  //531  三菱1           波尔卡                       
26,  //532  奥克斯4         波尔卡                       
117,  //533  伊莱克斯1       波尔卡                       
37,  //534  长虹4           波尔卡                       
14,  //535  美的(东芝)3     波尔卡                       
75,  //536  华凌7           天元
78,  //537  科龙(华宝)11    天元
37,  //538  长虹4           天元
14,  //539  美的(东芝)3     天元
60,  //540  三菱1           天元
8,  //541  志高15          东宝
117,  //542  伊莱克斯1       东宝
22,  //543  奥克斯7         东宝
14,  //544  美的(东芝)3     东宝
60,  //545  三菱1           东宝
37,  //546  长虹4           飞鹿
8,  //547  志高15          飞鹿
117,  //548  伊莱克斯1       飞鹿
60,  //549  三菱1           小鸭
75,  //550  华凌7           小鸭
8,  //551  志高15          小鸭
65,  //552  格兰仕3         双鹿
65,  //553  格兰仕3         双鹿
0,  //554  奥克斯9         凉宇
0,  //555  奥克斯9         凉宇
117,  //556  伊莱克斯1       小天鹅                       
26,  //557  奥克斯4         小天鹅                       
156,  //558  加组三星1       小天鹅   
157,  //559  格力1           索华
77,  //560  科龙(华宝)10    索华
77,  //561  科龙(华宝)10    索华
60,  //562  三菱1           朗歌
60,  //563  三菱1           朗歌
60,  //564  三菱1           皇冠
60,  //565  三菱1           皇冠
62,  //566  志高3           众力
62,  //567  志高3           众力
14,  //568  美的(东芝)3     塔兰迪                       
14,  //569  美的(东芝)3     塔兰迪                       
60,  //570  三菱1           雾峰
60,  //571  三菱1           雾峰
139,  //572  百合控制板      杂牌
141,  //573  冠远控制板      杂牌
145,  //574  科朗02A         杂牌
147,  //575  群达控制板      杂牌
138,  //576  ;SimpLlcrty     杂牌
164,  //577  格力2           格力    15    2011-12-17 14:50                        	
157,  //578  格力1           格力         
4,  //579  格力14          格力         
3,  //580  格力10          格力         
38,  //581  格力12          格力         
2,  //582  格力13          格力         
8,  //583  志高15          格力         
31,  //584  格力6           格力         
157,  //585  格力1           格力         
38,  //586  格力12          格力         
103,  //587  格力11          格力         
3,  //588  格力10          格力         
133,  //589  三菱19          格力         
105,  //590  三菱12          格力         
8,  //591  志高15          格力         
157,  //592  格力1           格力         
4,  //593  格力14          格力         
3,  //594  格力10          格力         
38,  //595  格力12          格力         
2,  //596  格力13          格力         
15,  //597  格力2           格力         
31,  //598  格力6           格力         
157,  //599  格力1           格力         
38,  //600  格力12          格力         
103,  //601  格力11          格力         
105,  //602  三菱12          美的/东芝    
14,  //603  美的(东芝)3     美的/东芝    
133,  //604  三菱19          美的/东芝    
10,  //605  美的(东芝)11    美的/东芝    
82,  //606  美的(东芝)9     美的/东芝    
105,  //607  三菱12          美的/东芝    
82,  //608  美的(东芝)9     美的/东芝    
105,  //609  三菱12          美的/东芝    
14,  //610  美的(东芝)3     美的/东芝    
133,  //611  三菱19          美的/东芝    
10,  //612  美的(东芝)11    美的/东芝    
82,  //613  美的(东芝)9     美的/东芝    
105,  //614  三菱12          美的/东芝    
82,  //615  美的(东芝)9     美的/东芝    
105,  //616  三菱12          美的/东芝    
14,  //617  美的(东芝)3     美的/东芝    
133,  //618  三菱19          美的/东芝    
10,  //619  美的(东芝)11    美的/东芝    
82,  //620  美的(东芝)9     美的/东芝    
105,  //621  三菱12          美的/东芝    
1,  //622  长虹5           长虹         
13,  //623  长虹16          长虹         
37,  //624  长虹4           长虹         
33,  //625  长虹3           长虹         
32,  //626  长虹2           长虹         
14,  //627  美的(东芝)3     长虹         
26,  //628  奥克斯4         长虹         
33,  //629  长虹3           长虹         
35,  //630  长虹9           长虹         
26,  //631  奥克斯4         长虹         
36,  //632  长虹12          长虹         
37,  //633  长虹4           长虹         
35,  //634  长虹9           长虹         
46,  //635  长虹10          长虹         
117,  //636  伊莱克斯1       长虹         
1,  //637  长虹5           长虹         
13,  //638  长虹16          长虹         
37,  //639  长虹4           长虹         
33,  //640  长虹3           长虹         
32,  //641  长虹2           长虹         
14,  //642  美的(东芝)3     长虹         
26,  //643  奥克斯4         长虹         
33,  //644  长虹3           长虹         
35,  //645  长虹9           长虹         
26,  //646  奥克斯4         长虹         
36,  //647  长虹12          长虹         
37,  //648  长虹4           长虹         
35,  //649  长虹9           长虹         
46,  //650  长虹10          长虹         
117,  //651  伊莱克斯1       长虹         
5,  //652  志高10          志高         
8,  //653  志高15          志高         
110,  //654  志高7           志高         
9,  //655  志高2           志高         
60,  //656  三菱1           志高         
66,  //657  格兰仕6         志高         
110,  //658  志高7           志高         
62,  //659  志高3           志高         
8,  //660  志高15          志高         
68,  //661  TCL5            志高         
133,  //662  三菱19          志高         
64,  //663  志高12          志高         
63,  //664  三菱9           志高         
65,  //665  格兰仕3         志高         
74,  //666  志高6           志高         
67,  //667  华凌5           志高         
72,  //668  志高13          志高         
74,  //669  志高6           志高         
69,  //670  志高14          志高         
105,  //671  三菱12          志高         
9,  //672  志高2           志高         
5,  //673  志高10          志高         
8,  //674  志高15          志高         
110,  //675  志高7           志高         
9,  //676  志高2           志高         
60,  //677  三菱1           志高         
66,  //678  格兰仕6         志高         
110,  //679  志高7           志高         
62,  //680  志高3           志高         
8,  //681  志高15          志高         
68,  //682  TCL5            志高         
133,  //683  三菱19          志高         
64,  //684  志高12          志高         
63,  //685  三菱9           志高         
65,  //686  格兰仕3         志高         
86,  //687  松下(乐声)6     松下/乐声    
92,  //688  松下(乐声)2     松下/乐声    
85,  //689  松下(乐声)19    松下/乐声    
90,  //690  松下(乐声)18    松下/乐声    
87,  //691  松下(乐声)7     松下/乐声    
106,  //692  松下(乐声)9     松下/乐声    
90,  //693  松下(乐声)18    松下/乐声    
91,  //694  松下(乐声)13    松下/乐声    
30,  //695  LG10            松下/乐声    
88,  //696  松下(乐声)3     松下/乐声    
92,  //697  松下(乐声)2     松下/乐声    
93,  //698  松下(乐声)17    松下/乐声    
94,  //699  松下(乐声)21    松下/乐声    
95,  //700  松下(乐声)16    松下/乐声    
89,  //701  松下(乐声)8     松下/乐声    
95,  //702  松下(乐声)16    松下/乐声    
87,  //703  松下(乐声)7     松下/乐声    
86,  //704  松下(乐声)6     松下/乐声    
92,  //705  松下(乐声)2     松下/乐声    
85,  //706  松下(乐声)19    松下/乐声    
90,  //707  松下(乐声)18    松下/乐声    
87,  //708  松下(乐声)7     松下/乐声    
106,  //709  松下(乐声)9     松下/乐声    
90,  //710  松下(乐声)18    松下/乐声    
91,  //711  松下(乐声)13    松下/乐声    
30,  //712  LG10            松下/乐声    
88,  //713  松下(乐声)3     松下/乐声    
92,  //714  松下(乐声)2     松下/乐声    
93,  //715  松下(乐声)17    松下/乐声    
94,  //716  松下(乐声)21    松下/乐声    
39,  //717  海尔18          海尔         
44,  //718  海尔12          海尔         
6,  //719  海尔19          海尔         
39,  //720  海尔18          海尔         
41,  //721  海尔15          海尔         
8,  //722  志高15          海尔         
11,  //723  海尔1           海尔         
12,  //724  夏普18          海尔         
40,  //725  海尔3           海尔         
44,  //726  海尔12          海尔         
42,  //727  海尔9           海尔         
43,  //728  海尔13          海尔         
8,  //729  志高15          海尔         
39,  //730  海尔18          海尔         
44,  //731  海尔12          海尔         
6,  //732  海尔19          海尔         
39,  //733  海尔18          海尔         
41,  //734  海尔15          海尔         
8,  //735  志高15          海尔         
11,  //736  海尔1           海尔         
12,  //737  夏普18          海尔         
40,  //738  海尔3           海尔         
44,  //739  海尔12          海尔         
42,  //740  海尔9           海尔         
43,  //741  海尔13          海尔         
62,  //742  志高3           三菱         
5,  //743  志高10          三菱         
8,  //744  志高15          三菱         
133,  //745  三菱19          三菱         
60,  //746  三菱1           三菱         
65,  //747  格兰仕3         三菱         
63,  //748  三菱9           三菱         
158,  //749  三凌KP2ES       三菱         
130,  //750  三菱7           三菱         
67,  //751  华凌5           三菱         
128,  //752  三菱14          三菱         
69,  //753  志高14          三菱         
105,  //754  三菱12          三菱         
127,  //755  三菱13          三菱         
99,  //756  春兰2           三菱         
129,  //757  三菱4           三菱         
126,  //758  三菱10          三菱         
132,  //759  三菱17          三菱         
68,  //760  TCL5            三菱         
9,  //761  志高2           三菱         
131,  //762  三菱8           三菱         
128,  //763  三菱14          三菱         
66,  //764  格兰仕6         三菱         
62,  //765  志高3           三菱         
5,  //766  志高10          三菱         
8,  //767  志高15          三菱         
133,  //768  三菱19          三菱         
60,  //769  三菱1           三菱         
65,  //770  格兰仕3         三菱         
63,  //771  三菱9           三菱         
158,  //772  三凌KP2ES       三菱         
130,  //773  三菱7           三菱         
67,  //774  华凌5           三菱         
128,  //775  三菱14          三菱         
69,  //776  志高14          三菱         
105,  //777  三菱12          三菱         
127,  //778  三菱13          三菱         
99,  //779  春兰2           三菱         
129,  //780  三菱4           三菱         
126,  //781  三菱10          三菱         
65,  //782  格兰仕3         格兰仕       
8,  //783  志高15          格兰仕       
66,  //784  格兰仕6         格兰仕       
70,  //785  格兰仕1         格兰仕       
69,  //786  志高14          格兰仕       
70,  //787  格兰仕1         格兰仕       
60,  //788  三菱1           格兰仕       
5,  //789  志高10          格兰仕       
99,  //790  春兰2           格兰仕       
8,  //791  志高15          格兰仕       
65,  //792  格兰仕3         格兰仕       
8,  //793  志高15          格兰仕       
66,  //794  格兰仕6         格兰仕       
70,  //795  格兰仕1         格兰仕       
69,  //796  志高14          格兰仕       
70,  //797  格兰仕1         格兰仕       
60,  //798  三菱1           格兰仕       
5,  //799  志高10          格兰仕       
99,  //800  春兰2           格兰仕       
8,  //801  志高15          格兰仕       
7,  //802  科龙(华宝)1     科龙/华宝    
77,  //803  科龙(华宝)10    科龙/华宝    
78,  //804  科龙(华宝)11    科龙/华宝    
8,  //805  志高15          科龙/华宝    
79,  //806  科龙(华宝)9     科龙/华宝    
58,  //807  科龙(华宝)5     科龙/华宝    
80,  //808  科龙(华宝)6     科龙/华宝    
7,  //809  科龙(华宝)1     科龙/华宝    
77,  //810  科龙(华宝)10    科龙/华宝    
81,  //811  科龙(华宝)7     科龙/华宝    
104,  //812  科龙(华宝)8     科龙/华宝    
79,  //813  科龙(华宝)9     科龙/华宝    
7,  //814  科龙(华宝)1     科龙/华宝    
77,  //815  科龙(华宝)10    科龙/华宝    
78,  //816  科龙(华宝)11    科龙/华宝    
8,  //817  志高15          科龙/华宝    
79,  //818  科龙(华宝)9     科龙/华宝    
58,  //819  科龙(华宝)5     科龙/华宝    
80,  //820  科龙(华宝)6     科龙/华宝    
7,  //821  科龙(华宝)1     科龙/华宝    
77,  //822  科龙(华宝)10    科龙/华宝    
81,  //823  科龙(华宝)7     科龙/华宝    
104,  //824  科龙(华宝)8     科龙/华宝    
79,  //825  科龙(华宝)9     科龙/华宝    
7,  //826  科龙(华宝)1     科龙/华宝    
16,  //827  奥克斯1         奥克斯       
22,  //828  奥克斯7         奥克斯       
17,  //829  奥克斯3         奥克斯       
0,  //830  奥克斯9         奥克斯       
26,  //831  奥克斯4         奥克斯       
21,  //832  奥克斯14        奥克斯       
18,  //833  奥克斯15        奥克斯       
25,  //834  奥克斯2         奥克斯       
23,  //835  奥克斯6         奥克斯       
26,  //836  奥克斯4         奥克斯       
19,  //837  奥克斯12        奥克斯       
24,  //838  奥克斯11        奥克斯       
22,  //839  奥克斯7         奥克斯       
20,  //840  奥克斯13        奥克斯       
21,  //841  奥克斯14        奥克斯       
16,  //842  奥克斯1         奥克斯       
22,  //843  奥克斯7         奥克斯       
17,  //844  奥克斯3         奥克斯       
0,  //845  奥克斯9         奥克斯       
26,  //846  奥克斯4         奥克斯       
21,  //847  奥克斯14        奥克斯       
18,  //848  奥克斯15        奥克斯       
25,  //849  奥克斯2         奥克斯       
23,  //850  奥克斯6         奥克斯       
26,  //851  奥克斯4         奥克斯       
107,  //852  夏普1           夏普/声宝    
96,  //853  夏普15          夏普/声宝    
12,  //854  夏普18          夏普/声宝    
107,  //855  夏普1           夏普/声宝    
108,  //856  夏普16          夏普/声宝    
97,  //857  夏普2           夏普/声宝    
12,  //858  夏普18          夏普/声宝    
107,  //859  夏普1           夏普/声宝    
96,  //860  夏普15          夏普/声宝    
12,  //861  夏普18          夏普/声宝    
107,  //862  夏普1           夏普/声宝    
108,  //863  夏普16          夏普/声宝    
97,  //864  夏普2           夏普/声宝    
12,  //865  夏普18          夏普/声宝    
107,  //866  夏普1           夏普/声宝    
96,  //867  夏普15          夏普/声宝    
12,  //868  夏普18          夏普/声宝    
107,  //869  夏普1           夏普/声宝    
108,  //870  夏普16          夏普/声宝    
97,  //871  夏普2           夏普/声宝    
48,  //872  大金1           大金         
49,  //873  大金10          大金         
50,  //874  大金11          大金         
57,  //875  大金9           大金         
51,  //876  大金2           大金         
52,  //877  大金3           大金         
56,  //878  大金8           大金         
48,  //879  大金1           大金         
53,  //880  大金4           大金         
57,  //881  大金9           大金         
55,  //882  大金7           大金         
50,  //883  大金11          大金         
84,  //884  华凌6           大金         
54,  //885  大金6           大金         
52,  //886  大金3           大金         
48,  //887  大金1           大金         
49,  //888  大金10          大金         
50,  //889  大金11          大金         
57,  //890  大金9           大金         
51,  //891  大金2           大金         
52,  //892  大金3           大金         
56,  //893  大金8           大金         
48,  //894  大金1           大金         
53,  //895  大金4           大金         
57,  //896  大金9           大金         
8,  //897  志高15          海信         
47,  //898  海信3           海信         
46,  //899  长虹10          海信         
61,  //900  海信5           海信         
37,  //901  长虹4           海信         
58,  //902  科龙(华宝)5     海信         
59,  //903  海信11          海信         
8,  //904  志高15          海信         
61,  //905  海信5           海信         
127,  //906  三菱13          海信         
59,  //907  海信11          海信         
8,  //908  志高15          海信         
47,  //909  海信3           海信         
46,  //910  长虹10          海信         
61,  //911  海信5           海信         
37,  //912  长虹4           海信         
58,  //913  科龙(华宝)5     海信         
59,  //914  海信11          海信         
8,  //915  志高15          海信         
61,  //916  海信5           海信         
113,  //917  富士通3         富士通       
111,  //918  富士通1         富士通       
114,  //919  富士通5         富士通       
116,  //920  富士通7         富士通       
112,  //921  富士通2         富士通       
111,  //922  富士通1         富士通       
116,  //923  富士通7         富士通       
115,  //924  富士通6         富士通       
113,  //925  富士通3         富士通       
115,  //926  富士通6         富士通       
113,  //927  富士通3         富士通       
111,  //928  富士通1         富士通       
114,  //929  富士通5         富士通       
116,  //930  富士通7         富士通       
112,  //931  富士通2         富士通       
111,  //932  富士通1         富士通       
116,  //933  富士通7         富士通       
115,  //934  富士通6         富士通       
113,  //935  富士通3         富士通       
115,  //936  富士通6         富士通       
9,  //937  志高2           华凌         
5,  //938  志高10          华凌         
8,  //939  志高15          华凌         
67,  //940  华凌5           华凌         
5,  //941  志高10          华凌         
62,  //942  志高3           华凌         
65,  //943  格兰仕3         华凌         
63,  //944  三菱9           华凌         
66,  //945  格兰仕6         华凌         
63,  //946  三菱9           华凌         
75,  //947  华凌7           华凌         
76,  //948  华凌3           华凌         
69,  //949  志高14          华凌         
84,  //950  华凌6           华凌         
75,  //951  华凌7           华凌         
156,  //952  加组三星1       华凌          
68,  //953  TCL5            华凌         
9,  //954  志高2           华凌         
5,  //955  志高10          华凌         
8,  //956  志高15          华凌         
67,  //957  华凌5           华凌         
5,  //958  志高10          华凌         
62,  //959  志高3           华凌         
65,  //960  格兰仕3         华凌         
63,  //961  三菱9           华凌         
27,  //962  LG13            LG           
29,  //963  LG8             LG           
27,  //964  LG13            LG           
30,  //965  LG10            LG           
28,  //966  LG3             LG           
27,  //967  LG13            LG           
27,  //968  LG13            LG           
29,  //969  LG8             LG           
27,  //970  LG13            LG           
30,  //971  LG10            LG           
83,  //972  日立3           日立         
134,  //973  日立5           日立         
135,  //974  日立1           日立         
135,  //975  日立1           日立         
136,  //976  日立7           日立         
155,  //977  日立(2002D)     日立         
136,  //978  日立7           日立         
135,  //979  日立1           日立         
83,  //980  日立3           日立         
134,  //981  日立5           日立         
135,  //982  日立1           日立         
135,  //983  日立1           日立         
136,  //984  日立7           日立         
155,  //985  日立(2002D)     日立         
136,  //986  日立7           日立         
67,  //987  华凌5           TCL          
5,  //988  志高10          TCL          
66,  //989  格兰仕6         TCL          
73,  //990  TCL3            TCL          
156,  //991  加组三星1       TCL           
68,  //992  TCL5            TCL          
65,  //993  格兰仕3         TCL          
65,  //994  格兰仕3         TCL          
69,  //995  志高14          TCL          
67,  //996  华凌5           TCL          
5,  //997  志高10          TCL          
66,  //998  格兰仕6         TCL          
73,  //999  TCL3            TCL  
};


//=========================================================================
//温度范围0~X
//自动，除湿，二种模式的温度取值范围
//高4bits为最大值，低4bits为最小值	；
//温度最大为31度
//=========================================================================
//;自动，除湿

/****************************constant define********************************/
//#define	TBOF_Auto_Mode	0
//#define	TBOF_DHMD_Mode	1
/********************自动，除湿 温度范围表************************************/
const u8  TEMP_Bound_Array[][2]={ 
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//0 奥克斯9(977-800-00)       
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//1 长虹5(KK9A)
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//2 格力13 
{(26-16)*0x10+(24-16),(26-16)*0x10+(24-16)},		//3 格力10                    
{(26-16)*0x10+(24-16),(26-16)*0x10+(26-16)},		//4 格力14                    
{3*0x10+0,(24-16)*0x10+(24-16)},		//5 志高10(ZH/LW-10)	     
{(24-16)*0x10+(24-16),(30-16)*0x10+(16-16)},		//6 海尔19（YL-G01）          
{4*0x10+0,4*0x10+0},		//7 科龙1(KYK-1408)           
{(31-16)*0x10+(17-16),(31-16)*0x10+(17-16)},		//8 志高15(ZC/JG-01)          
{(30-16)*0x10+(18-16),(30-16)*0x10+(18-16)},		//9 志高2(ZH/YB-02)           
{(30-16)*0x10+(17-16),(30-16)*0x10+(17-16)},		//10 美的(东芝)11:WH-F08J(东芝)               
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//11海尔1(YR-C03)             
{(19-16)*0x10+(19-16),(18-16)*0x10+(18-16)},		//12夏普18号机(CRMC-A171JBEO) 
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//13长虹16(KK5D)              
{(30-16)*0x10+(17-16),(30-16)*0x10+(17-16)},		//14美的3(R51)                
{(24-16)*0x10+(24-16),(30-16)*0x10+(16-16)},		//15格力2(YBOFB)              
{(24-16)*0x10+(24-16),(31-16)*0x10+(16-16)},		//16奥克斯1                   
{(31-16)*0x10+(16-16),(31-16)*0x10+(16-16)},		//17奥克斯3                   
{(24-16)*0x10+(24-16),(31-16)*0x10+(16-16)},		//18奥克斯15                  
{(24-16)*0x10+(24-16),(31-16)*0x10+(16-16)},		//19奥克斯12                  
{(31-16)*0x10+(16-16),(31-16)*0x10+(16-16)},		//20奥克斯13                  
{(24-16)*0x10+(24-16),(31-16)*0x10+(16-16)},		//21奥克斯14                  
{2*0x10+0,(31-16)*0x10+(16-16)},		//22奥克斯7                   
{(31-16)*0x10+(16-16),(31-16)*0x10+(16-16)},		//23奥克斯6                   
{(31-16)*0x10+(16-16),(31-16)*0x10+(16-16)},		//24奥克斯11                  
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//25奥克斯2                   
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//26奥克斯4                   
{4*0x10+0,(23-16)*0x10+(23-16)},		//27LG13(KT-LG1A)             
{4*0x10+0,(23-16)*0x10+(23-16)},		//28LG3:6711A20038Y           
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//29LG8                       
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//30LG10                      
{(25-16)*0x10+(25-16),(30-16)*0x10+(16-16)},		//31格力6(Y502SA)             
{(25-16)*0x10+(25-16),(31-16)*0x10+(18-16)},		//32 长虹2(GJYKQ-002AD)       
{(25-16)*0x10+(25-16),(31-16)*0x10+(18-16)},		//33 长虹3:KK5F               
{(31-16)*0x10+(18-16),(31-16)*0x10+(18-16)},		//34 澳柯玛2(GJYKQ-002A)      
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//35 长虹9：KK6A
{(31-16)*0x10+(18-16),(31-16)*0x10+(18-16)},		//36 长虹12
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//37 长虹4:KK1
{(25-16)*0x10+(25-16),(30-16)*0x10+(18-16)},		//38 格力12
{(25-16)*0x10+(25-16),(30-16)*0x10+(16-16)},		//39 海尔18:3400116
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//40 海尔3
{(25-16)*0x10+(25-16),(30-16)*0x10+(16-16)},		//41 海尔15（YR-D03）
{(25-16)*0x10+(25-16),(30-16)*0x10+(16-16)},		//42 海尔9(YR-M10)
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//43 海尔13(YR-H61)
{(25-16)*0x10+(25-16),(30-16)*0x10+(16-16)},		//44 海尔12(YL-D06)
{4*0x10+0,(30-16)*0x10+(16-16)},		//45 小三星
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//46 长虹10：KK2
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//47 海信3(RCH-3218NF)
{(30-16)*0x10+(16-16),(25-16)*0x10+(25-16)},		//48 大金1:ARC406A1
{2*0x10+0,(25-16)*0x10+(25-16)},		//49 大金10:KRC109-2
{(30-16)*0x10+(16-16),(25-16)*0x10+(25-16)},		//50 大金11(BRC4C153)
{(30-16)*0x10+(16-16),(25-16)*0x10+(25-16)},		//51 大金2ARC403A3
{(30-16)*0x10+(17-16),(25-16)*0x10+(25-16)},		//52 大金3:ARC433A1
{(30-16)*0x10+(20-16),(25-16)*0x10+(25-16)},		//53 大金4:ARC417A14
{2*0x10+0,(25-16)*0x10+(25-16)},		//54 大金6:ARC412A1
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//55 大金7:ARC412A5
{4*0x10+0,(25-16)*0x10+(25-16)},		//56 大金8:KRC114-11
{(30-16)*0x10+(17-16),(25-16)*0x10+(25-16)},		//57 大金9:KRC113-1
{4*0x10+0,4*0x10+0},		//58 科龙(华宝)5
{(31-16)*0x10+(18-16),(31-16)*0x10+(18-16)},		//59 海信11	
{(30-16)*0x10+(18-16),(30-16)*0x10+(18-16)},		//60 三菱1:RKN502A
{2*0x10+0,(31-16)*0x10+(16-16)},		//61 海信5
{(30-16)*0x10+(18-16),(30-16)*0x10+(18-16)},		//62 志高3
{(31-16)*0x10+(16-16),(31-16)*0x10+(16-16)},		//63 三菱9
{(31-16)*0x10+(16-16),(30-16)*0x10+(18-16)},		//64 志高12ZHF LW-09 
{4*0x10+0,(24-16)*0x10+(24-16)},		//65 格兰仕3(GZ-05BH)
{(24-16)*0x10+(24-16),(24-16)*0x10+(24-16)},		//66 格兰仕6:GZ-15A-E1
{4*0x10+0,(24-16)*0x10+(24-16)},		//67 华凌5:TCL-01B(冷暖)
{4*0x10+0,(24-16)*0x10+(24-16)},		//68 TCL5
{4*0x10+0,(25-16)*0x10+(25-16)},		//69 志高14:ZCF JG-08
{4*0x10+0,(24-16)*0x10+(24-16)},		//70 格兰仕1:GZ-18BGB
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//71 澳克玛3：YKQ-01
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//72 志高13
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//73 TCL3
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//74 志高6:ZH YT-06
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//75 华凌7 PRC-01
{(26-16)*0x10+(24-16),(26-16)*0x10+(26-16)},		//76 华凌3
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//77 科龙(华宝)10 RM--9003A
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//78 科龙(华宝)11		
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//79 科龙(华宝)9:RM-9203H
{4*0x10+0,4*0x10+0},		//80 科龙(华宝)6
{4*0x10+0,4*0x10+0},		//81 科龙(华宝)7
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//82 美的(东芝)9:Y011B
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//83 日立3
{4*0x10+0,(30-16)*0x10+(16-16)},		//84 华凌6
{2*0x10+0,(30-16)*0x10+(16-16)},		//85 松下(乐声)19:A75C453
{2*0x10+0,(30-16)*0x10+(16-16)},		//86 松下(乐声)6:A75C2047
{2*0x10+0,(30-16)*0x10+(16-16)},		//87 松下(乐声)7:A75C598
{2*0x10+0,(30-16)*0x10+(16-16)},		//88 松下(乐声)3:A75C699
{2*0x10+0,(30-16)*0x10+(16-16)},		//89 松下(乐声)8
{(30-16)*0x10+(20-16),(30-16)*0x10+(20-16)},		//90 松下(乐声)18:75C226
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//91 松下(乐声)13:A75C2552
{2*0x10+0,(30-16)*0x10+(16-16)},		//92 松下(乐声)2:A75C2663
{2*0x10+0,(30-16)*0x10+(16-16)},		//93 松下(乐声)17:A75C2959
{2*0x10+0,(30-16)*0x10+(16-16)},		//94 松下(乐声)21:A75C2841
{(30-16)*0x10+(16-16),(31-16)*0x10+(16-16)},		//95 松下(乐声)16:A75C2178
{10*0x10+0,10*0x10+0},		//96 夏普15:A379JB(+1)
{4*0x10+0,4*0x10+0},		//97 夏普2:CRMC-A344JBEO
{(20-16)*0x10+(20-16),(18-16)*0x10+(18-16)},		//98 春兰1:KT-CL3
{(20-16)*0x10+(20-16),(20-16)*0x10+(20-16)},		//99 春兰2:KT-CL2C
{(25-16)*0x10+(23-16),(30-16)*0x10+(16-16)},		//100乐华2:TY-6
{(28-16)*0x10+(20-16),(28-16)*0x10+(20-16)},		//101乐华1
{2*0x10+0,(20-16)*0x10+(20-16)},		//102春兰4(KL-CL1)
{4*0x10+0,(30-16)*0x10+(16-16)},		//103格力11
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//104科龙(华宝)8
{(30-16)*0x10+(18-16),(30-16)*0x10+(18-16)},		//105三菱12:RKK502A101F
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//106乐声9(A75C2275)
{4*0x10+0,4*0x10+0},		//107夏普1:0012SR
{4*0x10+0,4*0x10+0},		//108夏普16:A534JB
{(20-16)*0x10+(20-16),(20-16)*0x10+(20-16)},		//109新科2：HYF02-0311
{(30-16)*0x10+(18-16),(30-16)*0x10+(18-16)},		//110志高7:ZH YB-04
{4*0x10+0,(30-16)*0x10+(16-16)},		//111富士通1(AR-DJ18)
{4*0x10+0,(30-16)*0x10+(16-16)},		//112富士通2(AR-HJ1)
{4*0x10+0,(30-16)*0x10+(16-16)},		//113富士通3(AR-DC3)
{4*0x10+0,(30-16)*0x10+(16-16)},		//114富士通5(AR-WS3)
{4*0x10+0,(30-16)*0x10+(16-16)},		//115富士通6(AR-VA1)
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//116富士通7(AR-402A)
{(24-16)*0x10+(24-16),(30-16)*0x10+(16-16)},		//117伊莱克斯1
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//118伊莱克斯3(ELX-03-GR35H)
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//119约克1
{(16-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//120约克3:COR178R
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//121约克6(HG31AS)
{(30-16)*0x10+(16-16),(20-16)*0x10+(20-16)},		//122新科3
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//123三洋1(KL-2GHR1)
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//124三洋2(RL-8F0)
{(27-16)*0x10+(23-16),(30-16)*0x10+(16-16)},		//125三洋3(MPS-2006G)
{4*0x10+0,(24-16)*0x10+(24-16)},		//126三菱10:KD06ES
{(30-16)*0x10+(19-16),(30-16)*0x10+(19-16)},		//127三菱13:T7W560200
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//128三菱14:RKN502 A241F
{(30-16)*0x10+(18-16),(30-16)*0x10+(18-16)},		//129三菱4:RKN502A/500A/6D3)
{(30-16)*0x10+(18-16),(30-16)*0x10+(18-16)},		//130三菱7:RKH011H005F
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//131三菱8
{3*0x10+0,(24-16)*0x10+(24-16)},		//132三菱17(无型号)
{4*0x10+0,(30-16)*0x10+(18-16)},		//133三菱19:RKH011H505B
{1*0x10+0,(31-16)*0x10+(16-16)},		//134日立5(MPS-2002A)
{6*0x10+0,(31-16)*0x10+(16-16)},		//135日立1KF 752B
{(30-16)*0x10+(17-16),(30-16)*0x10+(17-16)},		//136日立7(PC-LH6)
{2*0x10+0,(31-16)*0x10+(17-16)},		//137惠而浦2
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//138Simplicrty(无屏)
{(28-16)*0x10+(22-16),(20-16)*0x10+(20-16)},		//139百合加装板
{(28-16)*0x10+(24-16),(31-16)*0x10+(18-16)},		//140大宇DR-9703L3
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//141冠远控制板
{(25-16)*0x10+(25-16),(30-16)*0x10+(16-16)},		//142汇丰2
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//143开利1
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//144开利3
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//145科朗02A
{4*0x10+0,(25-16)*0x10+(25-16)},		//146南风
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//147群达控制板
{(25-16)*0x10+(25-16),(30-16)*0x10+(16-16)},		//148先科-SAST (XK-01)
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//149新飞1
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//150三星3
{(28-16)*0x10+(24-16),(31-16)*0x10+(18-16)},		//151开利2
{2*0x10+0,(30-16)*0x10+(16-16)},		//152蓝波
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//153麦克维尔
{(25-16)*0x10+(25-16),(25-16)*0x10+(25-16)},		//154胜风-SHENGFENG
{(30-16)*0x10+(18-16),(30-16)*0x10+(18-16)},		//155日立2002D
{3*0x10+0,(24-16)*0x10+(24-16)},		//156三星1
{(24-16)*0x10+(24-16),(30-16)*0x10+(16-16)},		//157格力6
{4*0x10+0,(24-16)*0x10+(24-16)},		//158三凌KP2ES
{4*0x10+0,(30-16)*0x10+(16-16)},		//159富士通1(AR-JE11)
{(31-16)*0x10+(16-16),(31-16)*0x10+(16-16)},		//160 4009 op2-1000(AUX(白小尖头)
{(24-16)*0x10+(24-16),(24-16)*0x10+(24-16)},		//161 格兰仕GZ09-BE00-006
{(24-16)*0x10+(24-16),(24-16)*0x10+(24-16)},		//162 格兰仕 GZ-32B
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//163 SY01(三洋)	
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},		//164 SAIJO(泰国)

{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},			//日立 S-03     
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},	    //6号机-RC-4(HL)  
{(30-16)*0x10+(18-16),(31-16)*0x10+(31-16)},	    //大金-ARC433A49
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},	    //美的-东芝：R09B/BGCE
{(25-16)*0x10+(25-16),(30-16)*0x10+(16-16)},	    //格力YAD0F 
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)},	    //海信DG11J1-01                    
{(31-16)*0x10+(17-16),(31-16)*0x10+(17-16)},	    //开利RFL-0601EHL                  
{(31-16)*0x10+(16-16),(31-16)*0x10+(16-16)},     //FUNIKI--1                        
{(31-16)*0x10+(16-16),(31-16)*0x10+(16-16)},	    //新飞YK-040L                      
{(30-16)*0x10+(16-16),(30-16)*0x10+(16-16)}	    //3号机-RC-71-1 P/N 467200037R    	   		

};

//*************************************************************************************************************************
//操作标志
//不同的单一空调机遥控器的操作不大相同，用操作标志实现
//*************************************************************************************************************************
//===============================================================
//按键使能表
//按键使能标志,1按键有效，0表示按键没效
//bit0:  自动风向
//bit1:  睡眠
//bit2:  电辅热
//bit3:  强力
//bit4:  灯光
//bit5:  空清/净化/健康
//bit6:  经济
//===============================================================

/****************************constant define********************************/
//#define	EnK_AFANDIR	0x01		//自动风向
//#define	EnK_SLEEP	0x02		// 睡眠
//#define	EnK_HEAT	0x04		// 电辅热
//#define	EnK_STRONG	0x08		// 强力
//#define	EnK_LIGHT	0x10		// 灯光
//#define	EnK_AIRCLEAR	0x20		// 空清/净化/健康 
//#define	EnK_ECONOMIC	0x40		// 经济
//#define	EnK_MFANDIR	0x80		// 手动风向
//------------------------------------------------------------------
/********************按键使能表************************************/
const u8 KEY_ENABLE_Array[]={ 
EnK_AFANDIR+EnK_MFANDIR+EnK_SLEEP,		//0 奥克斯9(977-800-00)  
EnK_AFANDIR+EnK_MFANDIR+EnK_SLEEP+EnK_HEAT+EnK_AIRCLEAR,		//1 长虹5(KK9A)          
EnK_SLEEP+EnK_MFANDIR,		// 2 格力13            
EnK_MFANDIR,		//3 格力10               
EnK_SLEEP+EnK_MFANDIR,		//4 格力14               
EnK_AFANDIR+EnK_SLEEP+EnK_HEAT+EnK_ECONOMIC+EnK_MFANDIR,		//5 志高10(ZH/LW-10)	
EnK_AFANDIR+EnK_SLEEP+EnK_STRONG+EnK_LIGHT+EnK_AIRCLEAR+EnK_MFANDIR,		//6 海尔19（YL-G01）     
EnK_SLEEP+EnK_STRONG+EnK_MFANDIR,		//7 科龙1(KYK-1408)      
EnK_SLEEP+EnK_STRONG+EnK_ECONOMIC+EnK_MFANDIR,		//8 志高15(ZC/JG-01)     
EnK_SLEEP+EnK_HEAT+EnK_LIGHT+EnK_AIRCLEAR+EnK_MFANDIR,		//9 志高2(ZH/YB-02)      
EnK_SLEEP+EnK_AIRCLEAR+EnK_MFANDIR,		//10美的(东芝)11:WH-F08J(东芝)           
EnK_AIRCLEAR+EnK_MFANDIR,		//11海尔1(YR-C03)        
EnK_MFANDIR,		//12夏普18号机(CRMC-A171 
EnK_SLEEP+EnK_HEAT+EnK_AIRCLEAR+EnK_MFANDIR,		//13长虹16(KK5D)         
EnK_AFANDIR+EnK_HEAT+EnK_AIRCLEAR+EnK_ECONOMIC+EnK_MFANDIR,		//14美的3(R51)           
EnK_AFANDIR+EnK_SLEEP+EnK_HEAT+EnK_STRONG+EnK_LIGHT+EnK_AIRCLEAR+EnK_MFANDIR,		//15格力2(YBOFB)         
EnK_SLEEP+EnK_AIRCLEAR+EnK_MFANDIR,		//16奥克斯1              
EnK_AFANDIR+EnK_SLEEP+EnK_HEAT+EnK_STRONG+EnK_AIRCLEAR+EnK_MFANDIR+EnK_LIGHT,		//17奥克斯3              
EnK_SLEEP+EnK_AIRCLEAR+EnK_MFANDIR,		//18奥克斯15             
EnK_SLEEP+EnK_STRONG+EnK_AIRCLEAR+EnK_MFANDIR,		//19奥克斯12             
EnK_AFANDIR+EnK_SLEEP+EnK_AIRCLEAR+EnK_MFANDIR,		//20奥克斯13             
EnK_SLEEP+EnK_STRONG+EnK_MFANDIR,		//21奥克斯14             
EnK_AFANDIR+EnK_SLEEP+EnK_MFANDIR,		//22奥克斯7              
EnK_SLEEP+EnK_MFANDIR,		//23奥克斯6              
EnK_SLEEP+EnK_MFANDIR,		//24奥克斯11             
EnK_SLEEP+EnK_MFANDIR+EnK_STRONG+EnK_HEAT,		//25奥克斯2              
EnK_SLEEP,		//26奥克斯4              
EnK_MFANDIR+EnK_STRONG+EnK_SLEEP,		//27LG13(KT-LG1A)        
EnK_MFANDIR+EnK_ECONOMIC+EnK_STRONG+EnK_SLEEP+EnK_AIRCLEAR+EnK_LIGHT,		//28LG3:6711A20038Y  
0,		//29LG8
EnK_MFANDIR+EnK_STRONG+EnK_HEAT,		//30LG10
EnK_AFANDIR+EnK_SLEEP+EnK_LIGHT+EnK_AIRCLEAR+EnK_MFANDIR,		//31格力6(Y502SA)
EnK_SLEEP+EnK_AIRCLEAR+EnK_HEAT+EnK_MFANDIR,		//32 长虹2(GJYKQ-002AD)
EnK_SLEEP+EnK_AIRCLEAR+EnK_HEAT+EnK_MFANDIR,		//33 长虹3:KK5F
EnK_SLEEP+EnK_AIRCLEAR+EnK_HEAT+EnK_MFANDIR,		//34 澳柯玛2(GJYKQ-002A)
EnK_SLEEP+EnK_AIRCLEAR+EnK_STRONG+EnK_MFANDIR,		//35 长虹9：KK6A
EnK_AFANDIR+EnK_SLEEP+EnK_AIRCLEAR+EnK_HEAT+EnK_MFANDIR,		//36 长虹12
EnK_MFANDIR+EnK_SLEEP,		//37 长虹4:KK1
EnK_SLEEP+EnK_LIGHT+EnK_MFANDIR,		//38 格力12
EnK_SLEEP+EnK_AIRCLEAR+EnK_MFANDIR,		//39 海尔18:3400116
EnK_SLEEP+EnK_MFANDIR+EnK_AIRCLEAR,		//40 海尔3
EnK_SLEEP+EnK_AIRCLEAR+EnK_MFANDIR,		//41 海尔15（YR-D03）
EnK_SLEEP+EnK_AIRCLEAR+EnK_HEAT+EnK_MFANDIR,		//42 海尔9(YR-M10)
EnK_AFANDIR+EnK_SLEEP+EnK_AIRCLEAR+EnK_HEAT+EnK_LIGHT+EnK_MFANDIR,		//;43 海尔13(YR-H61)
EnK_AFANDIR+EnK_SLEEP+EnK_AIRCLEAR+EnK_HEAT+EnK_LIGHT+EnK_MFANDIR,		//44 海尔12(YL-D06)
EnK_SLEEP+EnK_STRONG+EnK_MFANDIR,		//45 小三星
EnK_AFANDIR+EnK_SLEEP+EnK_STRONG+EnK_ECONOMIC+EnK_MFANDIR+EnK_LIGHT,		//46 长虹10：KK2
EnK_SLEEP+EnK_STRONG+EnK_MFANDIR,		//47 海信3(RCH-3218NF)
EnK_MFANDIR,		//48 大金1:ARC406A1
EnK_MFANDIR,		//49 大金10:KRC109-2
EnK_MFANDIR,		//50 大金11(BRC4C153)
EnK_MFANDIR,		//51 大金2ARC403A3
EnK_MFANDIR+EnK_SLEEP+EnK_STRONG,		//52 大金3:ARC433A1
EnK_STRONG+EnK_MFANDIR,		//53 大金4:ARC417A14
EnK_MFANDIR,		//54 大金6:ARC412A1
EnK_MFANDIR,		//55 大金7:ARC412A5
EnK_AIRCLEAR+EnK_MFANDIR,		//56 大金8:KRC114-11
00,		//57 大金9:KRC113-1
EnK_SLEEP+EnK_HEAT+EnK_STRONG+EnK_MFANDIR,		//58 科龙(华宝)5
EnK_SLEEP+EnK_MFANDIR,		//59 海信11	
EnK_SLEEP+EnK_MFANDIR,		//60 三菱1:RKN502A
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//61 海信5
EnK_SLEEP+EnK_LIGHT+EnK_AIRCLEAR+EnK_MFANDIR+EnK_AFANDIR,		//62 志高3
EnK_SLEEP+EnK_HEAT+EnK_LIGHT+EnK_AIRCLEAR+EnK_MFANDIR,		//63 三菱9
EnK_SLEEP+EnK_HEAT+EnK_LIGHT+EnK_AIRCLEAR+EnK_MFANDIR,		//64 志高12ZHF LW-09 
EnK_SLEEP+EnK_HEAT+EnK_MFANDIR,		//65 格兰仕3(GZ-05BH)
EnK_SLEEP+EnK_MFANDIR,		//66 格兰仕6:GZ-15A-E1
EnK_SLEEP+EnK_HEAT+EnK_MFANDIR,		//67 华凌5:TCL-01B(冷暖)
EnK_SLEEP+EnK_HEAT+EnK_MFANDIR,		//68 TCL5
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//69 志高14:ZCF JG-08
EnK_SLEEP+EnK_HEAT+EnK_MFANDIR+EnK_AFANDIR,		//70 格兰仕1:GZ-18BGB
EnK_SLEEP+EnK_HEAT+EnK_MFANDIR,		//71 澳克玛3：YKQ-01
EnK_SLEEP,		//72 志高13
EnK_SLEEP+EnK_MFANDIR,		//73 TCL3
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG+EnK_AIRCLEAR+EnK_LIGHT,		//74 志高6:ZH YT-06
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG,		//75 华凌7 PRC-01
EnK_SLEEP+EnK_MFANDIR,		//76 华凌3
EnK_SLEEP,		//77 科龙(华宝)10 RM--9003A
EnK_SLEEP+EnK_MFANDIR,		//78 科龙(华宝)11
EnK_MFANDIR,		//79 科龙(华宝)9:RM-9203H
EnK_SLEEP+EnK_MFANDIR,		//80 科龙(华宝)6
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG+EnK_AIRCLEAR+EnK_HEAT+EnK_LIGHT,		//81 科龙(华宝)7
EnK_MFANDIR+EnK_AFANDIR,		//82 美的(东芝)9:Y011B
EnK_SLEEP+EnK_MFANDIR,		//83 日立3
EnK_SLEEP+EnK_MFANDIR,		//84 华凌6
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG,		//85 松下(乐声)19:A75C453
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG,		//86 松下(乐声)6:A75C2047
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//87 松下(乐声)7:A75C598
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//88 松下(乐声)3:A75C699
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG+EnK_AIRCLEAR,		//89 松下(乐声)8
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//90 松下(乐声)18:75C226
EnK_MFANDIR,		//91 松下(乐声)13:A75C2552
EnK_SLEEP+EnK_MFANDIR+EnK_STRONG,		//92 松下(乐声)2:A75C2663
EnK_MFANDIR,		//93 松下(乐声)17:A75C2959
EnK_MFANDIR,		//94 松下(乐声)21:A75C2841
EnK_MFANDIR,		//95 松下(乐声)16:A75C2178
EnK_MFANDIR+EnK_AFANDIR,		//96 夏普15:A379JB(+1)
EnK_MFANDIR,		//97 夏普2:CRMC-A344JBEO
EnK_SLEEP+EnK_MFANDIR,		//98 春兰1:KT-CL3
EnK_SLEEP+EnK_MFANDIR,		//99 春兰2:KT-CL2C
EnK_SLEEP+EnK_AIRCLEAR+EnK_MFANDIR,		//100乐华2:TY-6
EnK_SLEEP+EnK_MFANDIR,		//101乐华1
00,		//102春兰4(KL-CL1)
EnK_SLEEP+EnK_MFANDIR,		//103格力11
EnK_SLEEP+EnK_MFANDIR,		//104科龙(华宝)8
EnK_SLEEP+EnK_MFANDIR,		//105三菱12:RKK502A101F
EnK_MFANDIR+EnK_LIGHT,		//106乐声9(A75C2275)
EnK_SLEEP+EnK_MFANDIR,		//107夏普1:0012SR
EnK_SLEEP+EnK_AIRCLEAR+EnK_MFANDIR+EnK_AFANDIR,		//108夏普16:A534JB
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG+EnK_AIRCLEAR,		//109新科2：HYF02-0311
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG+EnK_AIRCLEAR+EnK_ECONOMIC+EnK_LIGHT,		//110志高7:ZH YB-04
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//111富士通1(AR-DJ18)
EnK_SLEEP+EnK_MFANDIR,		//112富士通2(AR-HJ1)
EnK_SLEEP+EnK_MFANDIR,		//113富士通3(AR-DC3)
EnK_SLEEP+EnK_MFANDIR,		//114富士通5(AR-WS3)
EnK_MFANDIR,		//115富士通6(AR-VA1)
EnK_SLEEP+EnK_MFANDIR,		//116富士通7(AR-402A)	
EnK_SLEEP+EnK_MFANDIR+EnK_STRONG+EnK_AIRCLEAR,		//117伊莱克斯1
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_AIRCLEAR+EnK_ECONOMIC,		//118伊莱克斯3(ELX-03-GR35H)
EnK_SLEEP+EnK_MFANDIR,		//119约克1
EnK_SLEEP+EnK_MFANDIR+EnK_AIRCLEAR,		//120约克3:COR178R
EnK_SLEEP+EnK_MFANDIR,		//121约克6(HG31AS)
EnK_MFANDIR,		//122新科3
EnK_MFANDIR,		//123三洋1(KL-2GHR1)
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG,		//124三洋2(RL-8F0)
EnK_MFANDIR+EnK_AIRCLEAR,		//125三洋3(MPS-2006G)
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG,		//126三菱10:KD06ES
EnK_MFANDIR,		//127三菱13:T7W560200
EnK_MFANDIR,		//128三菱14:RKN502 A241F
EnK_SLEEP+EnK_MFANDIR+EnK_ECONOMIC+EnK_STRONG,		//129三菱4:RKN502A/500A/6D3)
EnK_MFANDIR,		//130三菱7:RKH011H005F
EnK_MFANDIR,		//131三菱8
00,		//132三菱17(无型号)
EnK_MFANDIR,		//133三菱19:RKH011H505B
EnK_SLEEP+EnK_MFANDIR,		//134日立5(MPS-2002A)
EnK_SLEEP+EnK_MFANDIR,		//135日立1KF 752B
EnK_MFANDIR+EnK_AIRCLEAR,		//136日立7(PC-LH6)								
EnK_SLEEP,		//137惠而浦2
EnK_MFANDIR,		//138Simplicrty(无屏)
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//139百合加装板
EnK_SLEEP+EnK_MFANDIR,		//140大宇DR-9703L3
EnK_MFANDIR,		//141冠远控制板
EnK_SLEEP+EnK_MFANDIR,		//142汇丰2
EnK_MFANDIR+EnK_ECONOMIC+EnK_STRONG,		//143开利1
EnK_ECONOMIC,		//144开利3
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//145科朗02A
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR+EnK_AIRCLEAR,		//146南风
EnK_SLEEP+EnK_MFANDIR,		//147群达控制板
EnK_SLEEP+EnK_MFANDIR,		//148先科-SAST (XK-01)
EnK_SLEEP+EnK_MFANDIR,		//149新飞1
EnK_SLEEP+EnK_MFANDIR+EnK_STRONG,		//150三星3
EnK_MFANDIR,		//151开利2
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//152蓝波
EnK_SLEEP+EnK_MFANDIR,		//153麦克维尔						
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//154胜风-SHENGFENG
EnK_MFANDIR,		//155日立2002D
EnK_AFANDIR+EnK_SLEEP+EnK_HEAT+EnK_ECONOMIC+EnK_MFANDIR,		//156三星1	
EnK_AFANDIR+EnK_SLEEP+EnK_HEAT+EnK_STRONG+EnK_LIGHT+EnK_AIRCLEAR+EnK_MFANDIR,		//157格力6
EnK_MFANDIR+EnK_AFANDIR+EnK_STRONG,		//158三凌KP2ES
EnK_SLEEP+EnK_MFANDIR+EnK_AFANDIR,		//159富士通1(AR-JE11)
EnK_SLEEP+EnK_MFANDIR+EnK_AIRCLEAR,		//160 4009 op2-1000(AUX(白小尖头)
EnK_SLEEP+EnK_STRONG+EnK_ECONOMIC+EnK_MFANDIR+EnK_LIGHT,		//161 格兰仕GZ09-BE00-006
EnK_SLEEP+EnK_STRONG+EnK_MFANDIR+EnK_HEAT+EnK_AIRCLEAR+EnK_AFANDIR,		//162 格兰仕 GZ-32B	
EnK_MFANDIR+EnK_SLEEP+EnK_STRONG+EnK_ECONOMIC,		//163 SY01(三洋)
EnK_MFANDIR+EnK_SLEEP,		//164 SAIJO(泰国)

EnK_SLEEP+EnK_STRONG+EnK_MFANDIR,			//	日立 S-03
EnK_AFANDIR+EnK_MFANDIR+EnK_SLEEP+EnK_AIRCLEAR+EnK_STRONG,	    //6号机-RC-4(HL)
EnK_AFANDIR+EnK_MFANDIR+EnK_SLEEP+EnK_STRONG,	    //大金-ARC433A49
EnK_SLEEP+EnK_ECONOMIC+EnK_LIGHT,	    //美的-东芝：R09B/BGCE
EnK_AFANDIR+EnK_MFANDIR+EnK_SLEEP+EnK_STRONG+EnK_AIRCLEAR+EnK_ECONOMIC+EnK_LIGHT+EnK_HEAT,	    //格力YAD0F
EnK_MFANDIR+EnK_SLEEP,	    //海信DG11J1-01                   
EnK_MFANDIR+EnK_SLEEP,	    //开利RFL-0601EHL                 
EnK_SLEEP+EnK_MFANDIR+EnK_STRONG+EnK_ECONOMIC,	    //FUNIKI--1                       
EnK_AFANDIR+EnK_SLEEP+EnK_MFANDIR+EnK_STRONG+EnK_HEAT, //新飞YK-040L                     
EnK_AFANDIR+EnK_SLEEP+EnK_MFANDIR+EnK_STRONG+EnK_AIRCLEAR,	   // 3号机-RC-71-1 P/N 467200037R  

};
//===============================================================
//单一空调遥控器特征表
//定时方式+显示+睡眠 方式标志
//bit4:  1->关机不关屏; 0->关机关屏
//bit5:  1->没屏;0->有屏
//bit6:  1->睡眠可设多少个小时,0->睡眠只需要一个标志位表示
//bit7:  1->左右风向，0->自动/手动风向
//bit0~bit3: 表示除湿模式的风量范围，bit4~bit5表示最小风量，bit6~bit7表示最大风量		//暂时还没有做这个功能
//===============================================================
//DHMD_FANLEV_MIN_BASE	EQU		00H
//DHMD_FANLEV_MAX_BASE	EQU		04H
//－－－－－－－－－－－－－－－－－－－－

/****************************constant define********************************/
//#define	F_DonotClrScreen	0x10		//关机不关屏
//#define	F_DonotDisp	0x20		//只显示时间/定时/码组号，其它都不显示，针没屏，且遥控器显示与空调机不能做到一致的情况；
//#define	F_SleepNHours	0x40		//睡眠可设多少个小时
//#define	F_FANDIR_LR	0x80		//左右风向 显示有用
//------------------------------------------------------------------------------------
/********************单一空调遥控器特征表************************************/
const u8 SYS_CHARACTER_Array[]={ 
F_DonotClrScreen+F_FANDIR_LR,		//0 奥克斯9(977-800-00)       
F_FANDIR_LR,		//1 长虹5(KK9A)               
0,		//2 格力13               
F_DonotClrScreen,		//3 格力10                    
F_DonotDisp+F_DonotClrScreen,		//4 格力14                    
0,		//5 志高10(ZH/LW-10)	     
F_FANDIR_LR,		//6 海尔19（YL-G01）          
F_DonotClrScreen,		//7 科龙1(KYK-1408)           
F_SleepNHours,		//8 志高15(ZC/JG-01)          
0,		//9 志高2(ZH/YB-02)           
0,		//10 美的(东芝)11:WH-F08J(东芝)              
0,		//11海尔1(YR-C03)             
F_DonotClrScreen,		//12夏普18号机(CRMC-A171JBEO) 
0,		//13长虹16(KK5D)              
0,		//14美的3(R51)                
F_FANDIR_LR,		//15格力2(YBOFB)              
0,		//16奥克斯1                   
0,		//17奥克斯3                   
0,		//18奥克斯15                  
0,		//19奥克斯12                  
F_FANDIR_LR,		//20奥克斯13                  
0,		//21奥克斯14                  
F_DonotClrScreen,		//22奥克斯7                   
F_DonotClrScreen,		//23奥克斯6                   
F_DonotClrScreen,		//24奥克斯11                  
F_DonotClrScreen,		//25奥克斯2                   
0,		//26奥克斯4                   
F_SleepNHours,		//27LG13(KT-LG1A)             
F_SleepNHours,		//28LG3:6711A20038Y           
F_DonotDisp+F_DonotClrScreen,		//29LG8                       
F_DonotClrScreen,		//30LG10                      
F_FANDIR_LR,		//31格力6(Y502SA)             
00,		//32 长虹2(GJYKQ-002AD)       
00,		//33 长虹3:KK5F             
00,		//34 澳柯玛2(GJYKQ-002A)      
00,		//35 长虹9：KK6A	
00,		//36 长虹12
F_FANDIR_LR,		//37 长虹4:KK1
00,		//38 格力12
00,		//39 海尔18:3400116
00,		//40 海尔3
00,		//41 海尔15（YR-D03）
00,		//42 海尔9(YR-M10)
F_FANDIR_LR,		//43 海尔13(YR-H61)
00,		//44 海尔12(YL-D06)
00,		//45 小三星
F_FANDIR_LR,		//46 长虹10：KK2
00,		//47 海信3(RCH-3218NF)
00,		//48 大金1:ARC406A1
00,		//49 大金10:KRC109-2
00,		//50 大金11(BRC4C153)
00,		//51 大金2ARC403A3
00,		//52 大金3:ARC433A1
00,		//53 大金4:ARC417A14
00,		//54 大金6:ARC412A1
00,		//55 大金7:ARC412A5
F_FANDIR_LR,		//56 大金8:KRC114-11
00,		//57 大金9:KRC113-1
F_DonotClrScreen,		//58 科龙(华宝)5
00,		//59 海信11	
F_SleepNHours,		//60 三菱1:RKN502A
00,		//61 海信5
00,		//62 志高3
00,		//63 三菱9
00,		//64 志高12ZHF LW-09 
00,		//65 格兰仕3(GZ-05BH)
00,		//66 格兰仕6:GZ-15A-E1
00,		//67 华凌5:TCL-01B(冷暖)
00,		//68 TCL5
00,		//69 志高14:ZCF JG-08
F_FANDIR_LR,		//70 格兰仕1:GZ-18BGB
00,		//71 澳克玛3：YKQ-01
F_DonotClrScreen,		//72 志高13
F_DonotClrScreen,		//73 TCL3
F_FANDIR_LR,		//74 志高6:ZH YT-06
00,		//75 华凌7 PRC-01	
F_DonotDisp+F_DonotClrScreen,		//76 华凌3
00,		//77 科龙(华宝)10 RM--9003A
00,		//78 科龙(华宝)11
00,		//79 科龙(华宝)9:RM-9203H
F_DonotClrScreen,		//80 科龙(华宝)6
F_FANDIR_LR,		//81 科龙(华宝)7 
F_DonotClrScreen,		//82 美的(东芝)9:Y011B
F_DonotDisp+F_DonotClrScreen,		//83 日立3
00,		//84 华凌6
F_DonotClrScreen,		//85 松下(乐声)19:A75C453
F_DonotClrScreen,		//86 松下(乐声)6:A75C2047
F_DonotClrScreen,		//87 松下(乐声)7:A75C598
F_DonotClrScreen,		//88 松下(乐声)3:A75C699
F_DonotClrScreen,		//89 松下(乐声)8
F_DonotClrScreen,		//90 松下(乐声)18:75C226
F_DonotClrScreen,		//91 松下(乐声)13:A75C2552
00,		//92 松下(乐声)2:A75C2663
00,		//93 松下(乐声)17:A75C2959
00,		//94 松下(乐声)21:A75C2841
F_DonotClrScreen,		//95 松下(乐声)16:A75C2178
F_FANDIR_LR,		//96 夏普15:A379JB(+1)
00,		//97 夏普2:CRMC-A344JBEO
00,		//98 春兰1:KT-CL3
00,		//99 春兰2:KT-CL2C
00,		//100乐华2:TY-6
F_DonotClrScreen,		//101乐华1
00,		//102春兰4(KL-CL1)
00,		//103格力11
F_DonotClrScreen+F_DonotDisp,		//104科龙(华宝)8
00,		//105三菱12:RKK502A101F
F_DonotClrScreen+F_DonotDisp,		//106乐声9(A75C2275)
00,		//107夏普1:0012SR
F_FANDIR_LR,		//108夏普16:A534JB
00,		//109新科2：HYF02-0311
F_SleepNHours+F_FANDIR_LR,		//110志高7:ZH YB-04
F_SleepNHours,		//111富士通1(AR-DJ18)
F_SleepNHours,		//112富士通2(AR-HJ1)
F_SleepNHours,		//113富士通3(AR-DC3)
F_SleepNHours,		//114富士通5(AR-WS3)
00,		//115富士通6(AR-VA1)
00,		//116富士通7(AR-402A)
00,		//117伊莱克斯1
00,		//118伊莱克斯3(ELX-03-GR35H)
F_DonotClrScreen,		//119约克1
00,		//120约克3:COR178R
F_DonotClrScreen,		//121约克6(HG31AS)
00,		//122新科3
00,		//123三洋1(KL-2GHR1)
F_FANDIR_LR,		//124三洋2(RL-8F0)
00,		//125三洋3(MPS-2006G)
F_FANDIR_LR,		//126三菱10:KD06ES
00,		//127三菱13:T7W560200
00,		//128三菱14:RKN502 A241F
F_SleepNHours,		//129三菱4:RKN502A/500A/6D3)
F_DonotClrScreen,		//130三菱7:RKH011H005F
00,		//131三菱8
00,		//132三菱17(无型号)
00,		//133三菱19:RKH011H505B
F_SleepNHours+F_DonotClrScreen,		//134日立5(MPS-2002A)
F_SleepNHours,		//135日立1KF 752B
00,		//136日立7(PC-LH6)
00,		//137惠而浦2
F_DonotClrScreen+F_DonotDisp,		//138Simplicrty(无屏)
00,		//139百合加装板
00,		//140大宇DR-9703L3
00,		//141冠远控制板
F_DonotClrScreen,		//142汇丰2
00,		//143开利1
F_DonotClrScreen+F_DonotDisp,		//144开利3
00,		//145科朗02A
00,		//146南风
00,		//147群达控制板
00,		//148先科-SAST (XK-01)	
00,		//149新飞1
00,		//150三星3	
00,		//151开利2
00,		//152蓝波	
F_DonotClrScreen,		//153麦克维尔
00,		//154胜风-SHENGFENG
00,		//155日立2002D
00,		//156三星1
F_FANDIR_LR,		//157格力6			
F_FANDIR_LR,		//158三凌KP2ES
F_SleepNHours,		//159富士通1(AR-JE11)	
00,		//160 4009 op2-1000(AUX(白小尖头)
00,		//161 格兰仕GZ09-BE00-006
F_FANDIR_LR,		//162 格兰仕 GZ-32B
00,		//163 SY01(三洋)	
00,		//164 SAIJO(泰国)

00,			// 	日立 S-03
F_DonotClrScreen+F_FANDIR_LR,	    // 6号机-RC-4(HL) 
F_FANDIR_LR,	    //  大金-ARC433A49
00,	    // 美的-东芝：R09B/BGCE
F_FANDIR_LR,	    // 格力YAD0F
F_DonotClrScreen,	    // 海信DG11J1-01                   
F_SleepNHours,	    // 开利RFL-0601EHL                 
00,	    // FUNIKI--1                       
F_FANDIR_LR,	    // 新飞YK-040L                     
F_DonotClrScreen+F_FANDIR_LR,	    //	3号机-RC-71-1 P/N 467200037R  
};

//===============================================================
//定时特征表
//bit0~bit1	定时方式（相对；绝对；显示绝对发码相对等）
//bit2:  1->开关机不取消定时; 0->开关机取消定时
//bit4~bit7	定时设定方式（关机设定开，开机设定关；开关机定开定关可同时设；定开定关只能在开机设；定时键一按键即发码）
//===============================================================
//定时特征表
//bit0~bit1	定时方式（相对；绝对；显示绝对发码相对等）
//bit2:  1->开关机不取消定时; 0->开关机取消定时
//bit4~bit7	定时设定方式（关机设定开，开机设定关；开关机定开定关可同时设；定开定关只能在开机设；定时键一按键即发码）
//===============================================================

/****************************constant define********************************/
//#define	TM_MODE_MASK	0x3		//bit0~bit1		;程序用来识别位置（加数据时不用管这个定义）
//;三种定时方式选择一种
//#define	CON_TM_MODE_OPPOSITE	0		//相对定时
//#define	CON_TM_MODE_ABSOLUTE	01		//绝对定时
//#define	CON_TM_MODE_FABSOLUTE	02		//假绝对定时（显示绝对发码相对）
//－－－－－－－－－－－－－－－－－－－－
//#define	F_NoTunoffTime	0x4		//开关机不取消定时
//－－－－－－－－－－－－－－－－－－－－
//#define	TM_SET_MASK	0x70		//bit4~bit7	;程序用来识别位置（加数据时不用管这个定义）
//;四种定时设置方式选择一种
//#define	CON_TM_SET_ONE	0*0x10		//关机设定开，开机设定关
//#define	CON_TM_SET_TWO	1*0x10		//开关机定开定关可同时设
//#define	CON_TM_SET_TWO_PT	2*0x10		//开关机定开定关可同时设,定关在前确定后自动开机，定开在前确定后关机
//#define	CON_TM_SET_SENDKEY	3*0x10		//定时键一按键即发码
//－－－－－－－－－－－－－－－－－－－－
//#define	F_Disable_TMON	0x80		//没有定开
//#define	F_Disable_TMOFF	0x8		//没有定关
//--------------------------------------------------------------------------------------
/********************定时特征表************************************/
const u8 TIME_CHARACTER_Array[]={ 
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//0 奥克斯9(977-800-00)              
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO_PT,		//1 长虹5(KK9A)                      
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//2 格力13                       
CON_TM_MODE_OPPOSITE+CON_TM_SET_SENDKEY,		//3 格力10                           
CON_TM_MODE_OPPOSITE+CON_TM_SET_SENDKEY,		//4 格力14                           
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//5 志高10(ZH/LW-10)	          
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO_PT,		//6 海尔19（YL-G01）                 
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//7 科龙1(KYK-1408)                  
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO+F_Disable_TMOFF,		//8 志高15(ZC/JG-01)                 
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//9 志高2(ZH/YB-02)                  
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//10 美的(东芝)11:WH-F08J(东芝)
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//11海尔1(YR-C03)                    
CON_TM_MODE_OPPOSITE+F_Disable_TMON+CON_TM_SET_TWO,		//12夏普18号机(CRMC-A171JBEO)        
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO_PT,		//13长虹16(KK5D)                     
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//14美的3(R51)                       
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//15格力2(YBOFB)                     
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//16奥克斯1                          
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//17奥克斯3                          
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//18奥克斯15                         
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//19奥克斯12                         
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//20奥克斯13                         
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//21奥克斯14                         
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//22奥克斯7                          
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO,		//23奥克斯6                          
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//24奥克斯11  
CON_TM_SET_SENDKEY,		//25奥克斯2           
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//26奥克斯4                          
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//27LG13(KT-LG1A)                    
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//28LG3:6711A20038Y                                                                               
CON_TM_SET_SENDKEY,		//29LG8
CON_TM_SET_SENDKEY,		//30LG10
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//31格力6(Y502SA)
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO_PT,		//32 长虹2(GJYKQ-002AD)
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO_PT,		//33 长虹3:KK5F
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO_PT,		//34 澳柯玛2(GJYKQ-002A)
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO_PT,		//35 长虹9：KK6A
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO_PT,		//36 长虹12
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//37 长虹4:KK1
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//38 格力12
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//39 海尔18:3400116
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//40 海尔3
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO,		//41 海尔15（YR-D03）
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO,		//42 海尔9(YR-M10)
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO_PT,		//43 海尔13(YR-H61)	
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO,		//44 海尔12(YL-D06)
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//45 小三星
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//46 长虹10：KK2
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//47 海信3(RCH-3218NF)
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO+F_Disable_TMON,		//48 大金1:ARC406A1
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//49 大金10:KRC109-2
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//50 大金11(BRC4C153)
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//51 大金2ARC403A3
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//52 大金3:ARC433A1
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//53 大金4:ARC417A14
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//54 大金6:ARC412A1
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//55 大金7:ARC412A5
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//56 大金8:KRC114-11
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//57 大金9:KRC113-1
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO+F_Disable_TMON,		//58 科龙(华宝)5
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//59 海信11	
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO+F_Disable_TMOFF,		//60 三菱1:RKN502A
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//61 海信5
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//62 志高3
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//63 三菱9
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//64 志高12ZHF LW-09 
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//65 格兰仕3(GZ-05BH)
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//66 格兰仕6:GZ-15A-E1
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//67 华凌5:TCL-01B(冷暖)
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//68 TCL5
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//69 志高14:ZCF JG-08
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//70 格兰仕1:GZ-18BGB
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//71 澳克玛3：YKQ-01
F_Disable_TMON+F_Disable_TMOFF,		//72 志高13
CON_TM_SET_SENDKEY,		//73 TCL3
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//74 志高6:ZH YT-06
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//75 华凌7 PRC-01
CON_TM_SET_SENDKEY,		//76 华凌3
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//77 科龙(华宝)10 RM--9003A
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE+F_Disable_TMON,		//78 科龙(华宝)11
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//79 科龙(华宝)9:RM-9203H
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO+F_Disable_TMON,		//80 科龙(华宝)6
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//81 科龙(华宝)7 
CON_TM_SET_SENDKEY,		//82 美的(东芝)9:Y011B
CON_TM_SET_SENDKEY,		//83 日立3
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//84 华凌6
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//85 松下(乐声)19:A75C453
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//86 松下(乐声)6:A75C2047
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//87 松下(乐声)7:A75C598
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//88 松下(乐声)3:A75C699
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//89 松下(乐声)8
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//90 松下(乐声)18:75C226
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//91 松下(乐声)13:A75C2552
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//92 松下(乐声)2:A75C2663
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//93 松下(乐声)17:A75C2959
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//94 松下(乐声)21:A75C2841
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//95 松下(乐声)16:A75C2178
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//96 夏普15:A379JB(+1)
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//97 夏普2:CRMC-A344JBEO
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//98 春兰1:KT-CL3
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//99 春兰2:KT-CL2C
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//100乐华2:TY-6
F_Disable_TMON+F_Disable_TMOFF,		//101乐华1
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//102春兰4(KL-CL1)
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//103格力11
CON_TM_SET_SENDKEY,		//104科龙(华宝)8
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO+F_Disable_TMOFF,		//105三菱12:RKK502A101F
CON_TM_SET_SENDKEY,		//106乐声9(A75C2275)
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//107夏普1:0012SR
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//108夏普16:A534JB
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//109新科2：HYF02-0311
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//110志高7:ZH YB-04
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO_PT,		//111富士通1(AR-DJ18)
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO_PT,		//112富士通2(AR-HJ1)
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO_PT,		//113富士通3(AR-DC3)
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO_PT,		//114富士通5(AR-WS3)
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO_PT,		//115富士通6(AR-VA1)
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//116富士通7(AR-402A)
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//117伊莱克斯1
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//118伊莱克斯3(ELX-03-GR35H)
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//119约克1
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//120约克3:COR178R
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//121约克6(HG31AS)
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//122新科3							
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//123三洋1(KL-2GHR1)
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//124三洋2(RL-8F0)
F_Disable_TMOFF+F_Disable_TMON,		//125三洋3(MPS-2006G)
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO,		//126三菱10:KD06ES
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//127三菱13:T7W560200
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//128三菱14:RKN502 A241F
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO+F_Disable_TMOFF,		//129三菱4:RKN502A/500A/6D3)
CON_TM_MODE_FABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//130三菱7:RKH011H005F
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//131三菱8			
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//132三菱17(无型号)
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//133三菱19:RKH011H505B
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//134日立5(MPS-2002A)
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//135日立1KF 752B
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//136日立7(PC-LH6)
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE+F_Disable_TMON,		//137惠而浦2
CON_TM_SET_SENDKEY,		//138Simplicrty(无屏)
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//139百合加装板
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//140大宇DR-9703L3
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//141冠远控制板
CON_TM_MODE_ABSOLUTE+CON_TM_SET_TWO,		//142汇丰2
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//143开利1
CON_TM_SET_SENDKEY,		//144开利3
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//145科朗02A
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO_PT,		//146南风
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//147群达控制板
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//148先科-SAST (XK-01)
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//149新飞1
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE+F_Disable_TMON,		//150三星3
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//151开利2
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//152蓝波
CON_TM_MODE_ABSOLUTE+F_NoTunoffTime+CON_TM_SET_TWO,		//153麦克维尔	
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//154胜风-SHENGFENG
CON_TM_MODE_OPPOSITE+F_NoTunoffTime+CON_TM_SET_TWO,		//155日立2002D
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO,		//156三星1
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//157格力6
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,		//158三凌KP2ES
CON_TM_MODE_OPPOSITE+CON_TM_SET_TWO_PT,		//159富士通1(AR-JE11)   
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,		//160 4009 op2-1000(AUX(白小尖头)         
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//161 格兰仕GZ09-BE00-006
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//162 格兰仕 GZ-32B
CON_TM_MODE_OPPOSITE+F_Disable_TMON+CON_TM_SET_SENDKEY,		//163 SY01(三洋)	
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,		//164 SAIJO(泰国) 

CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,         //   日立 S-03                     
CON_TM_MODE_FABSOLUTE+CON_TM_SET_TWO,	    // 6号机-RC-4(HL)                   
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,	    //  大金-ARC433A49                  
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,	    //  美的-东芝：R09B/BGCE            
CON_TM_MODE_OPPOSITE+CON_TM_SET_ONE,	    // 格力YAD0F                        
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,	    //  海信DG11J1-01                   
CON_TM_MODE_FABSOLUTE+CON_TM_SET_ONE,	    //  开利RFL-0601EHL                 
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,	    //  FUNIKI--1                       
CON_TM_MODE_ABSOLUTE+CON_TM_SET_ONE,	    //  新飞YK-040L                     
CON_TM_MODE_FABSOLUTE+CON_TM_SET_ONE,	    // 	3号机-RC-71-1 P/N 467200037R    

};



